---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptWarning
source: html/cc3383bb-beee-2c0a-5848-1ca414620cc1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptWarning Property

Some families have become unusable. Reload the families, or delete them from the model.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyIsCorruptWarning { get; }
```